code/openfoam/test/Lagrangian/transfers/0/Lagrangian/droplets/rho
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       LagrangianScalarField;
    location    "0/Lagrangian/droplets";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [density];

internalField   uniform $uniformValue;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    ".*"
    {
        type            calculated;
    }
}

sources
{
    injection
    {
        type            uniformFixedValue;
        uniformValue    $uniformValue;
    }
}


// ************************************************************************* //
