code/openfoam/test/Lagrangian/transfers/0/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

interfaceHeight 0.2 [m];
interfaceThickness 0.04 [m];

internalField
{
    type            coded;

    evaluate
    #{
        const volInternalScalarField z(C.component(2));

        const dimensionedScalar h = $<dimensionedScalar>interfaceHeight;
        const dimensionedScalar dh = $<dimensionedScalar>interfaceThickness;

        // Linear ramp over the interface thickness
        tmp<volInternalScalarField> r =
            min(max(0.5 + (h - z)/dh, scalar(0)), scalar(1));

        // Smooth cosine function for the volume fraction
        field = (1 - cos(constant::mathematical::pi*r))/2;
    #};
}

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    bottom
    {
        type            zeroGradient;
    }

    top
    {
        type            inletOutlet;
        inletValue      uniform 1;
    }
}


// ************************************************************************* //
